Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/AccumulationRegisters/ОплатаОтПокупателейДебиторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаОтПокупателейДебиторов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияГрафиков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибокПрошлыхЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетовПоЗаймам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОплатитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccumulationRegisters/ИсполнениеДоговоровСПокупателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИсполнениеДоговоровСПокупателями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияГрафиков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибокПрошлыхЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполнитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/CommonModules/УчетДоходовРасходов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Метод регламентного задания "ФормированиеДокументовСписанияДБП"
//
Процедура ФормированиеДокументовСписанияДБП() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ФормированиеДокументовСписанияДБП);
	
	ИмяСобытия = НСтр("ru = 'Формирование документов списания ДБП.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		НСтр("ru = 'Начато регламентное создание документов списания ДБП.'"));
		
	УстановитьПривилегированныйРежим(Истина);

	Если МонопольныйРежим() Тогда
		// Если база работает в монопольном режиме (например, запущено фоновое задание, которое включило монопольный режим
		//  и выгружает данные из области данных для последующей загрузки в модели сервиса),
		//  то будут ошибки при всех попытках записи данных в базу.
		ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		НСтр("ru='Принудительное завершение выполнения регламентного задания: информационная база открыта в монопольном режиме.'"));
		Возврат;
	КонецЕсли;
	
    ДатаДок = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СчетаДБП", БухгалтерскийУчет.СписокСчетов("401.40"));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(ДатаДок), ВидГраницы.Включая));
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиДБП.Организация КАК Организация,
	|	ЕСТЬNULL(ОстаткиДБП.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ОстаткиДБП.СуммаОстатокКт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&КонецПериода, Счет В (&СчетаДБП), , ) КАК ОстаткиДБП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Документы.СписаниеДоходовБудущихПериодов.СоздатьДокумент();
		ДокОбъект.Дата = ДатаДок;
		ДокОбъект.Организация = Выборка.Организация;
		ДокОбъект.ИФО = Выборка.ИФО;
		ДокОбъект.ТипПериода = 1;
		ДокОбъект.ЗаполнитьДокумент();
		
		Если ДокОбъект.ДоходыБудущихПериодов.Количество() > 0 Тогда
			
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"),
				ДокОбъект.Организация, ДокОбъект.Дата);
				ДокОбъект.Руководитель = Руководитель.ОтветственноеЛицоСсылка;
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ЗаписьЖурналаРегистрации(
				ИмяСобытия,
				УровеньЖурналаРегистрации.Информация,
				,
				,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Записан документ Списание доходов будущих периодов № %1.'")
				, ДокОбъект.Номер));
		КонецЕсли;
		
	КонецЦикла;	

	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		НСтр("ru = 'Завершено регламентное создание документов списания ДБП.'"));
	
КонецПроцедуры

// Определяет параметры признания доходов, расходов способом "По месяцам" для конкретного периода,
// в течение которого стоимость включается в доходы, расходы.
// Детально порядок расчета описан в комментариях в коде функции.
//
// Параметры:
//  НачалоПериода	 - Дата - начало периода, в течение которого стоимость должна быть включена в доходы, расходы
//  КонецПериода	 - Дата - конец периода, в течение которого стоимость должна быть включена в доходы, расходы
// Возвращаемое значение:
//  Структура - описывает порядок признания доходов, расходов в течение периода (профиль во времени)
//    * ВсегоКоличествоМесяцев - Число - количество месяцев в периоде, в виде десятичной дроби
//    * ЦелоеКоличествоМесяцев - Число - количество целых календарных месяцев в рамках периода, меньше или равно ВсегоКоличествоМесяцев
//    * НачалоПериодаЦелыхМесяцев - Дата - начало периода целых календарных месяцев в рамках периода
//    * КонецПериодаЦелыхМесяцев - Дата - конец периода целых календарных месяцев в рамках периода
//    * НецелыеМесяцы - ТаблицаЗначений - информация о нецелых календарных месяцах в рамках периода; 
//              каждая строка таблицы соответствует месяцу; может быть до двух нецелых месяцев - первый и последний
//       ** Месяц       - Дата  - начало нецелого месяца
//       ** Числитель   - Число - количество дней признания доходов, расходов в месяце
//       ** Знаменатель - Число - количество дней в месяце
//       ** Вес         - Число - вес месяца относительно целого календарного месяца, меньше 1
Функция ПараметрыПризнанияДоходовРасходовПоМесяцам(Знач НачалоПериода, Знач КонецПериода) Экспорт
	
	Расчет = Новый Структура;
	Расчет.Вставить("ВсегоКоличествоМесяцев",    0);
	
	Расчет.Вставить("ЦелоеКоличествоМесяцев",    0);
	Расчет.Вставить("НачалоПериодаЦелыхМесяцев", '0001-01-01');
	Расчет.Вставить("КонецПериодаЦелыхМесяцев",  '0001-01-01');
	
	Расчет.Вставить("НецелыеМесяцы", Новый ТаблицаЗначений);
	Расчет.НецелыеМесяцы.Колонки.Добавить("Месяц",       ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Расчет.НецелыеМесяцы.Колонки.Добавить("Числитель",   Новый ОписаниеТипов("Число"));
	Расчет.НецелыеМесяцы.Колонки.Добавить("Знаменатель", Новый ОписаниеТипов("Число"));
	Расчет.НецелыеМесяцы.Колонки.Добавить("Вес",         Новый ОписаниеТипов("Число"));
	
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода  = КонецДня(КонецПериода);
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(КонецПериода) Или НачалоПериода > КонецПериода Тогда
		Возврат Расчет;
	КонецЕсли;
	
	// В общем виде формула выглядит так:
	//
	// ВсегоКоличествоМесяцев = ВесПервогоМесяца + СуммаВесовЦелыхКалендарныхМесяцев + ВесПоследнегоМесяца, 
	// где
	//   ВесПервогоМесяца    = КоличествоДнейДействияВПервомМесяце    / КоличествоДнейПервогоМесяца;
	//   ВесПоследнегоМесяца = КоличествоДнейДействияВПоследнемМесяце / КоличествоДнейПоследнегоМесяца;
	//
	// Отдельные слагаемые могут отсутствовать.
	// Так, если период начинается в первый день месяца и заканчивается в последний день месяца (другими словами, первый и последний месяцы периода - полные),
	// то ВсегоКоличествоМесяцев = СуммаВесовЦелыхКалендарныхМесяцев.
	// СуммаВесовЦелыхКалендарныхМесяцев - натуральное число, включая 0.
	
	ПервыйМесяцПолный    = (НачалоМесяца(НачалоПериода) = НачалоПериода);
	ПоследнийМесяцПолный = (КонецМесяца(КонецПериода) = КонецПериода);
	
	Расчет.НачалоПериодаЦелыхМесяцев = ?(ПервыйМесяцПолный,    НачалоПериода, КонецМесяца(НачалоПериода) + 1);
	Расчет.КонецПериодаЦелыхМесяцев  = ?(ПоследнийМесяцПолный, КонецПериода,  НачалоМесяца(КонецПериода) - 1);
	
	// Часть срока, которая может быть выражена в календарных месяцах (целом числе месяцев)
	Если Расчет.НачалоПериодаЦелыхМесяцев < Расчет.КонецПериодаЦелыхМесяцев Тогда
		Расчет.ЦелоеКоличествоМесяцев    = (Год(Расчет.КонецПериодаЦелыхМесяцев) - Год(Расчет.НачалоПериодаЦелыхМесяцев)) * 12 
			+ Месяц(Расчет.КонецПериодаЦелыхМесяцев) - Месяц(Расчет.НачалоПериодаЦелыхМесяцев) + 1;
		Расчет.ВсегоКоличествоМесяцев    = Расчет.ЦелоеКоличествоМесяцев;
	КонецЕсли;
	
	Если ПервыйМесяцПолный И ПоследнийМесяцПолный Тогда
		Возврат Расчет;
	КонецЕсли;
	
	// Часть (части) периода, которые приходятся на неполные месяцы
	//
	// Не учитываем, что период может быть выражен целым числом месяцев.
	// Например, с 15 января по 14 февраля - это 1 месяц, но для расчета принимаем длину этого периода как 17/31 + 14/28 ~ 1.048 месяца.
	
	Если Не ПервыйМесяцПолный И Не ПоследнийМесяцПолный И НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) Тогда
		
		// вырожденный случай: период начинается после начала месяца и заканчивается до его окончания
		ОписаниеМесяца = Расчет.НецелыеМесяцы.Добавить();
		ОписаниеМесяца.Месяц = НачалоМесяца(НачалоПериода);
		ОписаниеМесяца.Числитель   = День(КонецПериода) - День(НачалоПериода) + 1;
		ОписаниеМесяца.Знаменатель = ОписаниеМесяца.Числитель;
		
	Иначе
	
		Если Не ПервыйМесяцПолный Тогда
			ОписаниеМесяца = Расчет.НецелыеМесяцы.Добавить();
			ОписаниеМесяца.Месяц = НачалоМесяца(НачалоПериода);
			ОписаниеМесяца.Числитель   = День(КонецМесяца(НачалоПериода)) - День(НачалоПериода) + 1;
			ОписаниеМесяца.Знаменатель = День(КонецМесяца(НачалоПериода));
		КонецЕсли;
		
		Если Не ПоследнийМесяцПолный Тогда
			ОписаниеМесяца = Расчет.НецелыеМесяцы.Добавить();
			ОписаниеМесяца.Месяц = НачалоМесяца(КонецПериода);
			ОписаниеМесяца.Числитель   = День(КонецПериода);
			ОписаниеМесяца.Знаменатель = День(КонецМесяца(КонецПериода));
		КонецЕсли;
	
	КонецЕсли;

	Для Каждого ОписаниеМесяца Из Расчет.НецелыеМесяцы Цикл
		ОписаниеМесяца.Вес = ОписаниеМесяца.Числитель / ОписаниеМесяца.Знаменатель;
		Расчет.ВсегоКоличествоМесяцев = Расчет.ВсегоКоличествоМесяцев + ОписаниеМесяца.Вес;
	КонецЦикла;
	
	Возврат Расчет;
	
КонецФункции

Функция КлассифицироватьСтатусОперацииНачисленияДоходов(СтатусОперации) Экспорт
	
	ПризнакиСтатусаОперации = Новый Структура;
	
	РеквизитыСтатусаОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатусОперации, "Код,СчетДт,СчетКт,СчетРасчетов");
	ПризнакиСтатусаОперации.Вставить("СтатусОперацииКод",          Лев(РеквизитыСтатусаОперации.Код, 5));
	ПризнакиСтатусаОперации.Вставить("СтатусОперацииСчетДт",       Лев(РеквизитыСтатусаОперации.СчетДт, 6));
	ПризнакиСтатусаОперации.Вставить("СтатусОперацииСчетКт",       Лев(РеквизитыСтатусаОперации.СчетКт, 6));
	ПризнакиСтатусаОперации.Вставить("СтатусОперацииСчетРасчетов", Лев(РеквизитыСтатусаОперации.СчетРасчетов, 6));
	
	ПризнакиСтатусаОперации.Вставить("ЭтоСтарыйФорматКода", (Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 1) = "0"));
	Если ПризнакиСтатусаОперации.ЭтоСтарыйФорматКода Тогда // Коды статусов в формате 0Y.XX с ведущим нулем.
		
		ПризнакиСтатусаОперации.Вставить("ЭтоИсправлениеОшибокПрошлыхЛет",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 4) = "01.3" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 4) = "01.4" ИЛИ 
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 4) = "02.3" ИЛИ  
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 4) = "02.7" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 4) = "02.8");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДатыПризнанияДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.22" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.26");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеПредельнойДатыИсполнения",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.23" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.27" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.29");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДатИсполнения",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.25" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "02.28");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоНачислениеДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 2) = "01" // "01 00" - первичное начисление по операциям признания в бухгалтерском учете (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 2) = "02" // "02 00" - уточнение начисления по ранее произведенным начислениям доходов (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоАннулированиеДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 2) = "03" // "03 00" - аннулирование начисления по ранее произведенным начислениям доходов ... (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоДеаннулированиеДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 2) = "04" // "04 00" - отмена аннулирования начисления (восстановление) ошибочно аннулированных начислений доходов ... (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
	Иначе // Коды статусов в формате ZY.XX.
		
		ВторойСимволКода = Сред(ПризнакиСтатусаОперации.СтатусОперацииКод, 2, 1);
		ПоследнийСимволКода = Сред(ПризнакиСтатусаОперации.СтатусОперацииКод, 5, 1);
		
		ПризнакиСтатусаОперации.Вставить("ЭтоИсправлениеОшибокПрошлыхЛет",
			ПоследнийСимволКода = "6" ИЛИ
			ПоследнийСимволКода = "7" ИЛИ 
			ПоследнийСимволКода = "8" ИЛИ  
			ПоследнийСимволКода = "9");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДатыПризнанияДоходов",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "12.52" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "22.52");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеПредельнойДатыИсполнения",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "12.53" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "22.53" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "32.53");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДатИсполнения",
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "12.54" ИЛИ
			Лев(ПризнакиСтатусаОперации.СтатусОперацииКод, 5) = "22.54");
		
		ПризнакиСтатусаОперации.Вставить("ЭтоНачислениеДоходов",
			ВторойСимволКода = "1" // "01 00" - первичное начисление по операциям признания в бухгалтерском учете (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоУточнениеДоходов",
			ВторойСимволКода = "2" // "02 00" - уточнение начисления по ранее произведенным начислениям доходов (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоАннулированиеДоходов",
			ВторойСимволКода = "3" // "03 00" - аннулирование начисления по ранее произведенным начислениям доходов ... (п.8 Приказа 61н).
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
			И ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
		
		ПризнакиСтатусаОперации.Вставить("ЭтоДеаннулированиеДоходов", Ложь); // Статусы деаннулирования не включены в новую классификацию из-за отсутствия в них необходимости.
		
	КонецЕсли;
	
	ПризнакиСтатусаОперации.Вставить("ЭтоНачислениеДоходовБудущихПериодов",
		ПризнакиСтатусаОперации.СтатусОперацииСчетКт = "401.40");
	
	ПризнакиСтатусаОперации.Вставить("ЭтоНачислениеДоходовТекущегоПериода",
		   (ПризнакиСтатусаОперации.СтатусОперацииСчетДт = "205.00"
		ИЛИ ПризнакиСтатусаОперации.СтатусОперацииСчетДт = "207.00"
		ИЛИ ПризнакиСтатусаОперации.СтатусОперацииСчетДт = "209.00")
		И Лев(ПризнакиСтатусаОперации.СтатусОперацииСчетКт, 5) = "401.1");
	
	ПризнакиСтатусаОперации.Вставить("ЭтоПризнаниеДоходовТекущегоПериода",
		ПризнакиСтатусаОперации.СтатусОперацииСчетДт = "401.40" И
		Лев(ПризнакиСтатусаОперации.СтатусОперацииСчетКт, 5) = "401.1");
	
	ПризнакиСтатусаОперации.Вставить("ЭтоКорректировкаБезИзмененияСуммы",
		Не ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт)
		И Не ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетКт));
	
	Возврат ПризнакиСтатусаОперации;
	
КонецФункции

Функция ВыводитьСуммуВКруглыхСкобках(СтатусОперацииКод) Экспорт
	
	ЭтоСтарыйФорматКода = (Лев(СтатусОперацииКод, 1) = "0");
	Если ЭтоСтарыйФорматКода Тогда
		ВыводитьСуммуВКруглыхСкобках = Лев(СтатусОперацииКод, 2) = "02" И 
			НЕ (Сред(СтатусОперацииКод, 4, 1) = "3" ИЛИ Сред(СтатусОперацииКод, 4, 1) = "5" ИЛИ Сред(СтатусОперацииКод, 4, 1) = "6"
			ИЛИ Сред(СтатусОперацииКод, 4, 1) = "7" ИЛИ Сред(СтатусОперацииКод, 4, 1) = "8" ИЛИ Сред(СтатусОперацииКод, 4, 1) = "9"
			ИЛИ Сред(СтатусОперацииКод, 4, 2) = "10");
	Иначе
		ВторойСимволКода = Сред(СтатусОперацииКод, 2, 1);
		ТретийСимволКода = Сред(СтатусОперацииКод, 4, 1);
		ЧетвертыйСимволКода = Сред(СтатусОперацииКод, 5, 1);

		ВыводитьСуммуВКруглыхСкобках = (ВторойСимволКода = "2") // "02 00" - уточнение начисления по ранее произведенным начислениям доходов (п.58 Приказа 61н).
		// Исключая статусы операций, связанные с исправлением ошибок.
		И НЕ (ТретийСимволКода = "5" 
		ИЛИ ЧетвертыйСимволКода = "6" ИЛИ ЧетвертыйСимволКода = "7" ИЛИ ЧетвертыйСимволКода = "8" ИЛИ ЧетвертыйСимволКода = "9"); 
	КонецЕсли;
	
	Возврат ВыводитьСуммуВКруглыхСкобках;
	
КонецФункции

// Возвращает настройки счетов учета доходов будущих периодов (401.4Х) для использования в формах документов.
//
Функция НастройкиСчетовУчетаДБП() Экспорт
	
	НастройкиСчетовУчетаДБП = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.Валютный КАК Валютный,
	|	ЕПСБУ.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	ЕПСБУ.РазрешитьНеУказыватьПодразделение КАК РазрешитьНеУказыватьПодразделение
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПОДСТРОКА(ЕПСБУ.Код, 0, 5) ПОДОБНО ""401.4""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураНастроек = Новый Структура("Валютный,УчетПоПодразделениям,РазрешитьНеУказыватьПодразделение");
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		НастройкиСчетовУчетаДБП.Вставить(Выборка.Ссылка, СтруктураНастроек);
	КонецЦикла;
	
	Возврат НастройкиСчетовУчетаДБП;
	
КонецФункции

// Контроль остатков по счетам 401.4Х при проведении документов списания доходов будущих периодов.
//
// Параметры:
//  ТаблицаРеализацияУслугРабот - таблица источника данных РеализацияУслугРабот, см. БухгалтерскиеОперацииИсточникиДанных.РеализацияУслугРабот();
//  ДокументОбъект - ДокументОбъект.НачислениеЗаУслугиОбразования,
//                   ДокументОбъект.НачислениеСтудентамЗаПрочиеУслуги,
//                   ДокументОбъект.СписаниеДоходовБудущихПериодов - документ списания доходов будущих периодов;
// 
Функция ОстаткиДоходовБудущихПериодовПревышены(ДокументОбъект, ТаблицаРеализацияУслугРабот) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если МетаданныеДокумента.Имя = "СписаниеДоходовБудущихПериодов" Тогда
		ИмяПоляСумма = "Всего";
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеЗаУслугиОбразования" ИЛИ МетаданныеДокумента.Имя = "НачислениеСтудентамЗаПрочиеУслуги" Тогда
		ИмяПоляСумма = "Сумма";
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация", ДокументОбъект.Организация);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	ОстаткиДБП = УчетДоходовРасходов.ОстаткиДоходовБудущихПериодов(ПериодОстатков, ТаблицаРеализацияУслугРабот, Реквизиты);
	
	ОстаткиПревышены = Ложь;
	
	Для Каждого СтрокаРеализации Из ТаблицаРеализацияУслугРабот Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаРеализации.ВидОперацииДБП)
			ИЛИ Не ЗначениеЗаполнено(СтрокаРеализации.СчетДБП) Тогда
			Продолжить; // Услуги, работы по краткосрочным договорам.
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СчетДБП", СтрокаРеализации.СчетДБП);
		Отбор.Вставить("КФО", СтрокаРеализации.КФО);
		Отбор.Вставить("Номенклатура", СтрокаРеализации.Номенклатура);
		
		СвойстваСчетаДБП = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРеализации.СчетДБП);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", СтрокаРеализации.ИФО);
		КонецЕсли;
		Если СвойстваСчетаДБП.УчетПоКПС Тогда
			Отбор.Вставить("КПС", СтрокаРеализации.КПС);
		КонецЕсли;
		Если СвойстваСчетаДБП.УчетПоКЭК Тогда
			Отбор.Вставить("КЭК", СтрокаРеализации.КЭК);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаДБП.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", СтрокаРеализации.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаДБП.Валютный Тогда
			Отбор.Вставить("Валюта", СтрокаРеализации.Валюта);
		КонецЕсли;
		Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаРеализации.СчетДБП) Тогда
			Отбор.Вставить("Договор", СтрокаРеализации.Договор);
		КонецЕсли;
		Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоКодамЦели(СтрокаРеализации.СчетДБП) Тогда
			Отбор.Вставить("КодЦели", СтрокаРеализации.КодЦели);
		КонецЕсли;
		
		ОстатокВал = 0;
		Если ОстаткиДБП.Количество() > 0 Тогда
			НайденныеСтрокиОстатков = ОстаткиДБП.НайтиСтроки(Отбор);
			Для Каждого СтрокаОстатков Из НайденныеСтрокиОстатков Цикл
				ОстатокВал = ОстатокВал + СтрокаОстатков.СуммаВал;
			КонецЦикла;
		КонецЕсли;
	
		Если СтрокаРеализации.СуммаВал > 0 И СтрокаРеализации.СуммаВал > ОстатокВал Тогда
			
			ТекстОшибки = НСтр("ru='Сумма доходов (начислений) превышает остаток доходов будущих периодов по счету бухгалтерского учета %1.
				|
				|Сумма доходов (начислений): %2; Остаток по счету %1: %3; Превышение: %4'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				СтрокаРеализации.СчетДБП,
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаРеализации.СуммаВал, СтрокаРеализации.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(ОстатокВал, СтрокаРеализации.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаРеализации.СуммаВал - ОстатокВал, СтрокаРеализации.Валюта, "0"));
			ПолеСумма = СтрокаРеализации.ИмяСписка + "[" + Формат(СтрокаРеализации.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]." + ИмяПоляСумма;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, ПолеСумма, "Объект");
			ОстаткиПревышены = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОстаткиПревышены;
	
КонецФункции

Функция ОстаткиДоходовБудущихПериодов(Период, ТаблицаДокумента, Реквизиты) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", Период);
	Запрос.УстановитьПараметр("Организация",   Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("Счета40140",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("СчетДБП")) );
	Запрос.УстановитьПараметр("ИФО",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("ИФО")) );
	Запрос.УстановитьПараметр("КФО",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("КФО")) );
	Запрос.УстановитьПараметр("КПС",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("КПС")) );
	Запрос.УстановитьПараметр("КЭК",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("КЭК")) );
	Запрос.УстановитьПараметр("Номенклатура",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("Номенклатура")) );
	Запрос.УстановитьПараметр("Договор",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("Договор")) );
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", Реквизиты.ИспользоватьВалютныйУчет);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Счет КАК СчетДБП,
	|	Остатки.Счет.УчетПоКПС КАК УчетПоКПС,
	|	Остатки.Счет.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	Остатки.Счет.Валютный КАК Валютный,
	|	ЕСТЬNULL(Остатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	Остатки.КЭК КАК КЭК,
	|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто1 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Остатки.Субконто1
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто1 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто1
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто1 ССЫЛКА Справочник.ВидыЦелевыхСредств
	|			ТОГДА Остатки.Субконто1
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.ВидыЦелевыхСредств
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.ВидыЦелевыхСредств
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ КАК КодЦели,
	|	ЕСТЬNULL(Остатки.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстатокКт
	|		ИНАЧЕ Остатки.СуммаОстатокКт
	|	КОНЕЦ КАК СуммаВал,
	|	Остатки.СуммаОстатокКт КАК СуммаРуб
	|ПОМЕСТИТЬ Остатки40140
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&МоментВремени, Счет В (&Счета40140), , Организация = &Организация) КАК Остатки
	|ГДЕ
	|	&УсловиеПоИФО
	|	И &УсловиеПоКФО
	|	И &УсловиеПоКПС
	|	И &УсловиеПоКЭК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки40140.СчетДБП КАК СчетДБП,
	|	Остатки40140.УчетПоКПС КАК УчетПоКПС,
	|	Остатки40140.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	Остатки40140.Валютный КАК Валютный,
	|	Остатки40140.ИФО КАК ИФО,
	|	Остатки40140.КФО КАК КФО,
	|	Остатки40140.КПС КАК КПС,
	|	Остатки40140.КЭК КАК КЭК,
	|	Остатки40140.Подразделение КАК Подразделение,
	|	Остатки40140.Субконто1 КАК Субконто1,
	|	Остатки40140.Субконто2 КАК Субконто2,
	|	Остатки40140.Субконто3 КАК Субконто3,
	|	Остатки40140.Номенклатура КАК Номенклатура,
	|	Остатки40140.Договор КАК Договор,
	|	Остатки40140.КодЦели КАК КодЦели,
	|	Остатки40140.Валюта КАК Валюта,
	|	Остатки40140.СуммаВал КАК СуммаВал,
	|	Остатки40140.СуммаРуб КАК СуммаРуб
	|ИЗ
	|	Остатки40140 КАК Остатки40140
	|ГДЕ
	|	&УсловиеПоНоменклатуре
	|	И &УсловиеПоДоговору";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИФО",
		?(Реквизиты.ИспользоватьУчетПоИФО, "ИФО В (&ИФО)", "ИСТИНА") );
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКФО", "КФО В (&КФО)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКПС", "КПС В (&КПС)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКЭК", "КЭК В (&КЭК)");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНоменклатуре",
		"Остатки40140.Номенклатура В (&Номенклатура)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору",
		"Остатки40140.Договор В (&Договор)");
	
	ОстаткиДБП = Запрос.Выполнить().Выгрузить();
	
	Возврат ОстаткиДБП;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

Функция ДокументыРегистрацииГрафиковПоДоговорам(Договоры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаОтПокупателейДебиторов.Регистратор КАК Регистратор,
	|	ОплатаОтПокупателейДебиторов.Договор КАК Договор
	|ИЗ
	|	РегистрНакопления.ОплатаОтПокупателейДебиторов КАК ОплатаОтПокупателейДебиторов
	|ГДЕ
	|	ОплатаОтПокупателейДебиторов.Договор В(&Договоры)
	|	И (ОплатаОтПокупателейДебиторов.Регистратор ССЫЛКА Документ.РегистрацияГрафиковИсполненияДоговоров
	|			ИЛИ ОплатаОтПокупателейДебиторов.Регистратор ССЫЛКА Документ.ВедомостьНачисленияДоходов
	|			ИЛИ ОплатаОтПокупателейДебиторов.Регистратор ССЫЛКА Документ.ИзвещениеОНачисленииДоходов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсполнениеДоговоровСПокупателями.Регистратор,
	|	ИсполнениеДоговоровСПокупателями.Договор
	|ИЗ
	|	РегистрНакопления.ИсполнениеДоговоровСПокупателями КАК ИсполнениеДоговоровСПокупателями
	|ГДЕ
	|	ИсполнениеДоговоровСПокупателями.Договор В(&Договоры)
	|	И (ИсполнениеДоговоровСПокупателями.Регистратор ССЫЛКА Документ.РегистрацияГрафиковИсполненияДоговоров
	|			ИЛИ ИсполнениеДоговоровСПокупателями.Регистратор ССЫЛКА Документ.ВедомостьНачисленияДоходов
	|			ИЛИ ИсполнениеДоговоровСПокупателями.Регистратор ССЫЛКА Документ.ИзвещениеОНачисленииДоходов)";
	Запрос.УстановитьПараметр("Договоры", Договоры);
	
	ДокументыРегистрацииГрафиков = Запрос.Выполнить().Выгрузить();
	ДокументыРегистрацииГрафиков.Индексы.Добавить("Договор");
	
	Возврат ДокументыРегистрацииГрафиков;
	
КонецФункции

#КонецОбласти
